app/views/tasks/show.html.erb

      <p><strong>Nombre:</strong> <%= @task.name %></p>
      <p><strong>Creado/a por: </strong><%= User.find(@task.user_id).name %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    <h2>Comentarios</h2>
    <% if current_user.groups.include?(@task.group) %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "groups" INNER JOIN "user_groups" ON "groups"."id" = "user_groups"."group_id" WHERE "user_groups"."user_id" = ? AND "groups"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]