app/controllers/home_controller.rb

SELECT "groups".* FROM "groups" INNER JOIN "user_groups" ON "groups"."id" = "user_groups"."group_id" WHERE "user_groups"."user_id" = ?  [["user_id", 1]]
---
    def index
        @groups = current_user.groups
        @users_in_groups = {}
        @expired_tasks =

        @groups.each do |group|